{
  "Wdecompose_target_modules": null,
  "base_model_name_or_path": "/root/llama_7b",
  "bias": "none",
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 8,
  "lora_dropout": 0.05,
  "merge_weights": false,
  "modules_to_save": null,
  "peft_type": "DORA",
  "r": 4,
  "dora_simple": true,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}